# Toposolid Create Sub Division(Document, IList Curve Loop ) Method

Source: https://www.revitapidocs.com/2026/6120f56d-5fa1-5682-587f-7e790b73f43a.htm

---

| Toposolid Create Sub Division(Document, IList Curve Loop ) Method |
| --- |

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Toposolid CreateSubDivision(
	Document document,
	IList<CurveLoop> profiles
)
```

```
Public Function CreateSubDivision (
	document As Document,
	profiles As IList(Of CurveLoop)
) As Toposolid
```

```
public:
Toposolid^ CreateSubDivision(
	Document^ document,
	IList<CurveLoop^>^ profiles
)
```

```
member CreateSubDivision :
        document : Document *
        profiles : IList<CurveLoop> -> Toposolid
```

#### Parameters

document Document
profiles IList CurveLoop

#### Return Value

Toposolid See Also

#### Reference

Toposolid Class CreateSubDivision Overload Autodesk.Revit.DB Namespace